In [1]:
import numpy as np

In [2]:
import pandas as pd

In [14]:
customer_data = ['costno','firstname','lastname','gender','age','profession','contactNo',
'emailId','city','state','isActive','createdDate','UpdatedDate']
product_data = ['productno','productName','Description','isActive','createdDate','UpdatedDate']
transactions_data = ['txnno','txndate','custno','amount','productno','spendby']

In [15]:

df_cust = pd.read_csv('C:\\Users\\Dell\\Downloads\\customers.csv',names=customer_list)

In [16]:
df_prod = pd.read_csv('C:\\Users\\Dell\\Downloads\\products.csv',names=product_list)

In [17]:
df_tran = pd.read_csv('C:\\Users\Dell\\Downloads\\transactions.csv',names=transactions_list)

### Usecase-1 Load all three csv datasets in Pandas Data frames and display first 5 records.

In [7]:
df_cust.head()

,costno,firstname,lastname,gender,age,profession,contactNo,emailId,city,state,isActive,createdDate,UpdatedDate
0,1,Leslie,Bass,F,27,B,37307,endslost@everyma1l.org,Gibson,Dellwood,Y,2017-09-21 12:38:22,2017-10-18 12:12:28
1,2,Judy,Burks,M,53,S,84759,rfleming@hotma1l.co.uk,Suwanee,Trabue,Y,2017-05-22 05:29:22,2017-10-18 12:12:28
2,3,Marsha,Doyle,F,48,B,80932,arethe53@ma1lbox.net,Perry,Moxadarla,Y,2017-09-03 12:11:29,2017-10-18 12:12:28
3,4,Alexis,Battle,M,27,S,71701,ofcame@ma1lbox.org,Morven,Dennis,Y,2017-02-16 04:05:35,2017-10-18 12:12:28
4,5,Martha,Combs,F,49,B,83947,camedied@everyma1l.us,Ocilla,Greenwood,Y,2017-05-15 07:34:35,2017-10-18 12:12:28

In [19]:
df_prod.head()

,productno,productName,Description,isActive,createdDate,UpdatedDate
0,1,Product1,pgqorighfa,Y,2017-04-03 07:58:55,2017-10-18 12:12:38
1,2,Product2,lmndaaweth,Y,2017-09-21 12:38:31,2017-10-18 12:12:38
2,3,Product3,urifeubrhh,Y,2017-09-08 10:32:12,2017-10-18 12:12:38
3,4,Product4,rlpcjxfarp,Y,2017-05-22 05:29:27,2017-10-18 12:12:38
4,5,Product5,hzcpozsgfc,Y,2017-02-02 08:40:29,2017-10-18 12:12:38

In [8]:
df_tran.head()

   txnno              txndate  custno  amount  productno spendby
0      1  2017-10-18 12:31:45     923    2559        376    Card
1      2  2017-10-18 12:31:45     219    1706        151    Card
2      3  2017-10-18 12:31:45     927    3462        707    Cash
3      4  2017-10-18 12:31:45     806     865        539    Card
4      5  2017-10-18 12:31:45     958    2494         25    Card

### Usecase-2 Display only those customers from CSV_s1, who purchased more than 3 products

In [19]:
df_tran.groupby('custno').filter(lambda df_tran:df_tran['custno'].count()>3)['custno'].unique()

array([326, 167, 753, 828,   4, 578, 558, 237,  86, 537, 187, 241, 331,
       735, 391, 356, 321, 709, 989], dtype=int64)

### OR .count().sort_value(prodno,asending = false) 
df[df[prodno]>3

### OR df_trans.groupby('custno').filter()(lambda trans_csv['custno'].count(>3).unique())

### Usecase-3 Display top 5 most demanded products from CSV_s1

In [26]:
df1 = df_tran.groupby('productno').count().sort_values('txnno',ascending = False).head()

### OR df_tran['production'].value_counts().head()

In [27]:
df1

           txnno  txndate  custno  amount  spendby
productno
82             5        5       5       5        5
768            5        5       5       5        5
900            5        5       5       5        5
427            5        5       5       5        5
233            4        4       4       4        4

### Usecase-4 Display top 5 transactions amount from CSV_s1

In [30]:
df2 = df_tran.groupby('amount').max().sort_values('amount',ascending = False).head()

### OR by using sort_values ('amount',ascendinf = False).head() or nlarge

In [31]:
df2

        txnno              txndate  custno  productno spendby
amount
4996      557  2017-10-18 12:31:46     670        509    Card
4992      306  2017-10-18 12:31:46     448        427    Cash
4981      575  2017-10-18 12:31:46     305        549    Card
4980      532  2017-10-18 12:31:46     230        658    Card
4966      233  2017-10-18 12:31:45     287        685    Card

### Usecase-5 Display distinct professions from CSV_s1

In [32]:
df3 = df_cust['profession'].unique()

In [33]:
df3

array(['B', 'S'], dtype=object)

### Usecase-6 Display highest age in CSV_s1 customerâ€™s dataset

In [34]:
df4 = df_cust['age'].max()

In [38]:
df4

64